## Staging
**✅ &nbsp; Terraform Init:** `success`
**✅ &nbsp; Terraform Validate:** `success`
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`
**✅ &nbsp; Conftest:** `success` 

**⚠️ &nbsp; Warning:** resources will be destroyed by this change!
```terraform
Plan: 3 to add, 0 to change, 1 to destroy
```

<details>
<summary>Show summary</summary>

|  CHANGE  |                           RESOURCE                            |
|----------|---------------------------------------------------------------|
| add      | `aws_cloudwatch_log_metric_filter.superset_docs_errors`       |
|          | `aws_cloudwatch_metric_alarm.superset_docs_errors`            |
| recreate | `aws_cloudwatch_metric_alarm.superset_docs_invocation_errors` |


</details>


<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  + create
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # aws_cloudwatch_log_metric_filter.superset_docs_errors will be created
  + resource "aws_cloudwatch_log_metric_filter" "superset_docs_errors" {
      + id             = (known after apply)
      + log_group_name = "/aws/lambda/cds-superset-docs"
      + name           = "error-superset-docs"
      + pattern        = "?ERROR ?Error ?error"

      + metric_transformation {
          + default_value = "0"
          + name          = "error-superset-docs"
          + namespace     = "superset-docs"
          + unit          = "None"
          + value         = "1"
        }
    }

  # aws_cloudwatch_metric_alarm.superset_docs_errors will be created
  + resource "aws_cloudwatch_metric_alarm" "superset_docs_errors" {
      + actions_enabled                       = true
      + alarm_actions                         = [
          + "arn:aws:sns:ca-central-1:257394494478:cloudwatch-alert-warning",
        ]
      + alarm_description                     = "`superset-docs` errors logged over 1 minute."
      + alarm_name                            = "errors-superset-docs"
      + arn                                   = (known after apply)
      + comparison_operator                   = "GreaterThanThreshold"
      + evaluate_low_sample_count_percentiles = (known after apply)
      + evaluation_periods                    = 1
      + id                                    = (known after apply)
      + metric_name                           = "error-superset-docs"
      + namespace                             = "superset-docs"
      + ok_actions                            = [
          + "arn:aws:sns:ca-central-1:257394494478:cloudwatch-alert-ok",
        ]
      + period                                = 60
      + statistic                             = "Sum"
      + tags                                  = {
          + "CostCentre" = "cds-superset-docs-staging"
          + "Terraform"  = "true"
        }
      + tags_all                              = {
          + "CostCentre" = "cds-superset-docs-staging"
          + "Terraform"  = "true"
        }
      + threshold                             = 0
      + treat_missing_data                    = "notBreaching"
    }

  # aws_cloudwatch_metric_alarm.superset_docs_invocation_errors must be replaced
-/+ resource "aws_cloudwatch_metric_alarm" "superset_docs_invocation_errors" {
      ~ alarm_name                            = "invokcation-errors-superset-docs" -> "invocation-errors-superset-docs" # forces replacement
      ~ arn                                   = "arn:aws:cloudwatch:ca-central-1:257394494478:alarm:invokcation-errors-superset-docs" -> (known after apply)
      - datapoints_to_alarm                   = 0 -> null
      - dimensions                            = {} -> null
      + evaluate_low_sample_count_percentiles = (known after apply)
      ~ id                                    = "invokcation-errors-superset-docs" -> (known after apply)
      - insufficient_data_actions             = [] -> null
        tags                                  = {
            "CostCentre" = "cds-superset-docs-staging"
            "Terraform"  = "true"
        }
        # (16 unchanged attributes hidden)
    }

Plan: 3 to add, 0 to change, 1 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: plan.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "plan.tfplan"
Releasing state lock. This may take a few moments...

```

</details>

<details>
<summary>Show Conftest results</summary>

```sh
WARN - plan.json - main - Cloudwatch log metric pattern is invalid: ["aws_cloudwatch_log_metric_filter.superset_docs_errors"]

20 tests, 19 passed, 1 warning, 0 failures, 0 exceptions

```

</details>
